weplanr-api/app/controllers/admin/dashboard_controller.rb

SELECT COUNT(*) FROM "conversations"
SELECT COUNT(*) FROM "quotes" WHERE (status = 'accepted' or status = 'fulfilled')
SELECT COUNT(*) FROM "vendors" INNER JOIN "users" ON "users"."id" = "vendors"."user_id" WHERE (last_activity_at < '2018-10-20 06:29:04.313962')
---
  def index
    render json: {
      data: {
        customers: customers_data,
        vendors: vendors_data,

        quotes: Quote.count,
        inquiries: Conversation.count,
        bookings: Quote.booked.count,

        expired_quotes: expired_quotes_data,
        overdue_invoices: overdue_invoices_data,

        active_users: active_users_data,
        inactive_users: inactive_users_data,

        referrals: {
          vendor_to_vendor: {
            total: Referral.vendor.count,
            successful: Referral.vendor.success.count,
          },
          customer_to_vendor: {