weplanr-api/app/controllers/client/messages_controller.rb

  def index
    records = Conversation.where('wedding_uid = ?', current_user.wedding.uid)
    records = records.search_vendors(params[:q]) if params[:q].present?
---
SELECT  "weddings".* FROM "weddings" WHERE "weddings"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "conversations".* FROM "conversations" WHERE (wedding_uid = '928b5558-3850-4dbb-a7f1-9dbe2b66e2cd') ORDER BY "conversations"."updated_at" DESC
SELECT  1 AS one FROM "vendors" WHERE "vendors"."user_id" = $1 LIMIT $2  [["user_id", 8], ["LIMIT", 1]]

  def snippets
    records = Conversation.where(uid: params[:uids])
---
SELECT "conversations".* FROM "conversations" WHERE "conversations"."uid" IS NULL