weplanr-api/app/controllers/client/profiles_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."wedding_id" = $1 AND ("users"."id" != $2) ORDER BY "users"."id" ASC LIMIT $3  [["wedding_id", 6], ["id", 8], ["LIMIT", 1]]
SELECT  "weddings".* FROM "weddings" WHERE "weddings"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  1 AS one FROM "favorites" WHERE "favorites"."user_id" = $1 LIMIT $2  [["user_id", 8], ["LIMIT", 1]]
---
  def favorites
    user = current_user.wedding&.users&.find{ |u| u.favorites.any? } || current_user