weplanr-api/app/controllers/client/todos_controller.rb

SELECT "todos".* FROM "todos"
---
  def dashboard
    if collection.any?

      @_collection = collection
        .sort_by{ |todo| [todo.timing_min_month.to_i * -1, (todo.is_a?(Organisr::DefaultTodo) ? todo.position : (todo.id + 999))] }
        .in_groups_of(6)
        .find{ |group| group.compact.any?{ |todo| todo.status == 'pending' } }
        &.compact || []