weplanr-api/app/controllers/client/vendors_controller.rb

  def featured
    data = current_user.wedding.pending_todos.map do |todo|
      Vendor.search_by_services(todo.service.name).reorder("RANDOM()").limit(1).first if todo.service
---
SELECT  "weddings".* FROM "weddings" WHERE "weddings"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "todos".* FROM "todos"
SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]